class Welded_joints:
    """Материалы для сварных соединений"""

    def __init__(self, electrode_type, steel_type):
        self.electrode_type = electrode_type
        self.steel_type = steel_type

    def big_r_wf(self):
        """Определяет по марке электрода его big_r_wf"""
        elec_type_dict = {'Э42, Э42А': 180,
                          'Э46, Э46А': 200,
                          'Э50, Э50А': 215,
                          'Э60': 240,
                          'Э70': 280,
                          }

        for k, v in elec_type_dict.items():
            if self.electrode_type == k:
                big_r_wf = v
                return big_r_wf

    def big_r_un(self):
        """Определяет по марке стали ее big_r_un"""
        steel_type_dic = {'С235 от 2 до 20 мм': 360,
                          'С235 св. 20 до 40 мм': 360,
                          'С235 св. 40 до 100 мм': 360,
                          'С235 св. 100 мм': 360,
                          'С245 от 2 до 20 мм': 370,
                          'С245 св. 20 до 30 мм': 370,
                          'С255 от 2 до 3.9 мм': 380,
                          'С255 от 4 до 10 мм': 380,
                          'С255 св. 10 до 20 мм': 370,
                          'С255 св. 20 до 40 мм': 370,
                          'С275 от 2 до 10 мм': 380,
                          'С275 св. 10 до 20 мм': 370,
                          'С285 от 2 до 3.9 мм': 390,
                          'С285 от 4 до 10 мм': 390,
                          'С285 св. 10 до 20 мм': 380,
                          'С345 от 2 до 10 мм': 490,
                          'С345 св. 10 до 20 мм': 470,
                          'С345 св. 20 до 40 мм': 460,
                          'С345 св. 40 до 60 мм': 450,
                          'С345 св. 60 до 80 мм': 440,
                          'С345 св. 80 до 160 мм': 430,
                          'С345К (только для Э50А) от 4 до 10 мм': 470,
                          'С375 от 2 до 10 мм': 510,
                          'С375 св. 10 до 20 мм': 490,
                          'С375 св. 20 до 40 мм': 480,
                          'С390 от 4 до 50 мм': 540,
                          'С390К от 4 до 30 мм': 540,
                          'С440 от 4 до 30 мм': 590,
                          'С440 св. 30 до 50 мм': 570,
                          'С590 от 4 до 10 мм': 635,
                          'С590К от 16 до 40 мм': 635,
                          }
        for k, v in steel_type_dic.items():
            if self.steel_type == k:
                big_r_un = v
                return big_r_un


